"app.title" = "Información del Sistema Mac";
"cpu.title" = "CPU";
"cpu.usage" = "Uso: %.1f%%";
"cpu.cores" = "Uso de núcleos";

"ram.title" = "Memoria";
"ram.usage" = "%.1f%% Usado";

"disk.title" = "Disco";
"disk.usage" = "%.1f%% Usado";

"network.title" = "Red";

"info.title" = "Información General";
"info.host" = "Nombre del equipo";
"info.model" = "Modelo";
"info.os" = "Sistema operativo";
"info.processor" = "Procesador";
"info.ramTotal" = "Memoria total";
"info.diskTotal" = "Espacio total";
"info.localIP" = "IP local";
"info.publicIP" = "IP pública";
"info.temp" = "Estado de temperatura";

"button.settings" = "Ajustes";
"button.quit" = "Salir de la app";
"button.save" = "Guardar cambios";
"button.close" = "Cerrar";
"button.help" = "Guía del usuario";
"button.report" = "Crear informe";
"button.contact" = "Contáctanos";
"button.showWindow" = "Modo ventana";
"report.title" = "Informe del Sistema";
"report.subtitle" = "Resumen de detalles de hardware y software";
"report.hardware" = "Especificaciones de Hardware";
"report.network" = "Información de Red";
"report.status" = "Estado Actual";
"report.copy" = "Copiar Informe";
"report.print" = "Imprimir";
"report.date" = "Fecha del Informe";

"settings.title" = "Ajustes";
"settings.general" = "General";
"settings.advanced" = "Avanzado";

"settings.view.title" = "Apariencia";
"settings.view.showWindow" = "Mostrar como ventana";
"settings.view.showCores" = "Mostrar uso de núcleos";
"settings.view.showNetwork" = "Mostrar tarjeta de red";
"settings.view.showDisk" = "Mostrar tarjeta de disco";

"settings.monitor.title" = "Monitor del Sistema";
"settings.monitor.toggle" = "Detener / Iniciar monitorización";
"settings.monitor.energyMode" = "Modo ahorro de energía";
"settings.monitor.refreshTime" = "Frecuencia de actualización: %.1f s";
"settings.monitor.reset" = "Restablecer historial de CPU y Red";

"settings.theme.title" = "Tema de apariencia";
"settings.theme.label" = "Tema";
"settings.theme.auto" = "Sistema";
"settings.theme.light" = "Claro";
"settings.theme.dark" = "Oscuro";
"menu.startup.title" = "Inicio";
"menu.startup.enable" = "Iniciar al iniciar sesión";
"menu.startup.disable" = "Desactivar inicio al iniciar sesión";

"temp.normal" = "Normal 🌡";
"temp.warm" = "Tibio";
"temp.hot" = "Caliente 🔥";
"temp.critical" = "Crítico 🚨";
"temp.unknown" = "Desconocido";
"ip.loading" = "Cargando...";
"ip.notFound" = "No encontrado";
"unknown" = "Desconocido";

"settings.language.title" = "Idioma";
"settings.language.system" = "Predeterminado del sistema";
"settings.language.restart" = "Reinicie la aplicación para que los cambios de idioma surtan efecto.";

"help.title" = "Ayuda";
"help.subtitle" = "Sistem Bilgi – Guía de funciones y uso";
"help.version" = "Sistem Bilgi – Versión 1.1  •  macOS 15+";
"help.developer" = "Desarrollador: ModelPC";

"help.cpu.title" = "Uso de la CPU";
"help.cpu.desc" = "Muestra el uso del procesador en tiempo real y su historial. El gráfico de CPU rastrea las últimas 30 lecturas. Se vuelve rojo por encima del 80 % y parpadea como alerta. En procesadores multinúcleo, active el uso por núcleo en Ajustes > Apariencia > 'Mostrar uso de núcleos'.";

"help.ram.title" = "Uso de memoria (RAM)";
"help.ram.desc" = "La suma de las páginas activas, inactivas y cableadas se calcula como memoria usada y se muestra como un porcentaje. La barra de progreso azul muestra el estado actual.";

"help.disk.title" = "Uso de disco";
"help.disk.desc" = "Muestra la capacidad total y el espacio usado de su disco principal (/) como un porcentaje. Puede ocultar la tarjeta de Disco en Ajustes > Apariencia > 'Mostrar tarjeta de disco'.";

"help.network.title" = "Uso de red";
"help.network.desc" = "Muestra la velocidad total de descarga + carga en todas las interfaces de red en KB/s. El gráfico visualiza las últimas 30 lecturas en una escala dinámica. Ocúltelo en Ajustes > Apariencia > 'Mostrar tarjeta de red'.";

"help.temp.title" = "Estado de temperatura";
"help.temp.desc" = "El nivel térmico del sistema se lee a través de la API ThermalState de macOS: Normal 🌡, Tibio, Caliente 🔥 y Crítico 🚨. Los valores de grados exactos no son expuestos por Apple a aplicaciones de terceros.";

"help.settings.title" = "Ajustes y Personalización";
"help.settings.desc" = "Abra Ajustes desde el icono de la barra de menús. Use la pestaña Apariencia para activar/desactivar tarjetas. Elija el tema Claro / Oscuro / Auto en la pestaña Avanzado. Ajuste la frecuencia de actualización entre 0,5 y 5 segundos. El Modo ahorro de energía reduce la frecuencia de actualización cuando la aplicación no está activa.";

"help.menubar.title" = "Barra de menús y Modo ventana";
"help.menubar.desc" = "La aplicación se ejecuta en la barra de menús de forma predeterminada. Active la ventana independiente en Ajustes > Apariencia > 'Mostrar como ventana'. La etiqueta de la barra de menús muestra el porcentaje de CPU en vivo y un mini gráfico.";

"contact.title" = "Contacto";
"contact.subtitle" = "Contacte con el desarrollador o sígalo en las redes sociales";
"contact.email.title" = "Enviar correo electrónico";
"contact.email.address" = "info@modelpc.com";
"contact.email.address2" = "Desarrollador (modelpc91@gmail.com)";
"contact.social" = "Redes Sociales";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Sitio Web";
